rushikesh81005-dev/autonomous-AI-powered-drone-for-SAR-mission-project-SAR-/SAR_Drone_ESP32_Direct_Controller.ino
struct GPSData {
  double lat = 0.0;
  double lng = 0.0;
  float speedMps = 0.0f;
  float courseDeg = 0.0f;
  uint8_t satellites = 0;
  bool fix = false;
  bool courseValid = false;
  uint32_t lastFixMs = 0;
};

struct AttitudeData {
  float rollDeg = 0.0f;
  float pitchDeg = 0.0f;
  float yawDeg = 0.0f;
  float gxDps = 0.0f;
  float gyDps = 0.0f;
  float gzDps = 0.0f;
};

struct PID {
  float kp;
  float ki;
  float kd;
  float integral;
  float previousMeasurement;
  float outputLimit;

  float update(float setpoint, float measurement, float dt) {
    const float error = setpoint - measurement;
    integral += error * dt;
    if (ki > 0.00001f) {
      const float iLimit = outputLimit / ki;
      integral = constrain(integral, -iLimit, iLimit);
    }
    // Derivative on measurement avoids a large kick when setpoint changes.
    const float derivative = -(measurement - previousMeasurement) / dt;
    previousMeasurement = measurement;
    return constrain(kp * error + ki * integral + kd * derivative,
                     -outputLimit, outputLimit);
  }

  void reset(float measurement = 0.0f) {
    integral = 0.0f;
    previousMeasurement = measurement;
  }
};

struct SurveyPlan {
  bool valid = false;
  double originLat = 0.0;
  double originLng = 0.0;
  float sideKm = 0.0f;
  float spacingKm = 0.0f;
  uint16_t pointsPerLine = 0;
  uint16_t lineCount = 0;
  uint32_t waypointIndex = 0;
  uint32_t waypointCount = 0;
};

// ============================= SHARED STATE =================================

portMUX_TYPE stateMux = portMUX_INITIALIZER_UNLOCKED;

volatile MissionState mission = MissionState::DISARMED;
volatile bool motorsArmed = false;
volatile bool imuHealthy = false;
volatile bool imuCalibrated = false;
volatile bool cameraHealthy = false;
volatile bool obstacleBrakeRequested = false;
volatile bool visualCandidateConfirmed = false;
volatile bool vibrationAlert = false;
volatile float vibrationRmsG = 0.0f;
volatile bool calibrationRequested = false;
volatile bool yawResetRequested = false;
volatile float requestedYawDeg = 0.0f;

GPSData gps;
AttitudeData attitude;
SurveyPlan survey;

double homeLat = 0.0;
double homeLng = 0.0;
volatile bool homeLocked = false;
double targetLat = 0.0;
double targetLng = 0.0;
volatile bool targetValid = false;
volatile bool headingReferenceSet = false;

float gyroBiasX = 0.0f;
float gyroBiasY = 0.0f;
float gyroBiasZ = 0.0f;
float commandedThrottleUs = ESC_MIN_US;
float desiredRollDeg = 0.0f;
float desiredPitchDeg = 0.0f;
float desiredYawRateDps = 0.0f;
uint16_t computedMotorUs[4] = {ESC_MIN_US, ESC_MIN_US, ESC_MIN_US, ESC_MIN_US};

// Angle outer-loop proportional gains: angle error -> desired angular rate.
float rollAngleKp  = 4.0f;
float pitchAngleKp = 4.0f;

// Conservative STARTING values only. Every airframe requires tuning.
PID rollRatePID  = {1.20f, 0.35f, 0.018f, 0, 0, 260};
PID pitchRatePID = {1.20f, 0.35f, 0.018f, 0, 0, 260};
PID yawRatePID   = {1.00f, 0.20f, 0.000f, 0, 0, 160};

TaskHandle_t flightTaskHandle = nullptr;
TaskHandle_t cameraTaskHandle = nullptr;
TaskHandle_t serviceTaskHandle = nullptr;

// ========================== FUNCTION DECLARATIONS ===========================

void flightTask(void *parameter);
void cameraTask(void *parameter);
void serviceTask(void *parameter);

bool initializeMPU();
bool calibrateMPU(uint16_t samples = 1200);
bool readMPU(float &ax, float &ay, float &az, float &gx, float &gy, float &gz);
void updateAttitude(float ax, float ay, float az, float gx, float gy, float gz);
void updateVibrationMonitor(float ax, float ay, float az);

void initializeEscOutputs();
void writeEscMicroseconds(uint8_t motor, uint16_t pulseUs);
void writeAllMotorsMinimum();
void runFlightController();
void computeMotorMix(float throttleUs, float rollCorrection,
                     float pitchCorrection, float yawCorrection);
void resetControllers();
bool armMotors();
void disarmMotors(const char *reason);

void parseGPS();
bool parseNMEALine(char *line);
bool validateNMEAChecksum(const char *line);
double nmeaCoordinateToDegrees(const char *field, bool longitude);
double distanceMeters(double lat1, double lon1, double lat2, double lon2);
float bearingDegrees(double lat1, double lon1, double lat2, double lon2);
float wrap180(float angle);
float wrap360(float angle);

void updateMissionLogic();
void updateNavigationSetpoints();
bool configureSurvey(double originLat, double originLng,
                     float sideKm, float spacingKm);
bool surveyWaypoint(uint32_t index, double &lat, double &lng);
void advanceSurveyWaypoint();

bool initializeCamera();
uint8_t frameLuminance(const camera_fb_t *frame, int pixelIndex);
void analyzeCameraFrame(camera_fb_t *frame);
void reportVisualCandidate();

void processSerialCommands();
void printStatus();
void printHelp();
void setupNetworkServices();
void sendTelemetry();

// ================================ SETUP ======================================

void setup() {
  Serial.begin(115200);
  delay(400);
  Serial.println();
  Serial.println("SAR ESP32 direct controller starting...");
  Serial.printf("BENCH_TEST_MODE=%s\n", BENCH_TEST_MODE ? "TRUE" : "FALSE");

  pinMode(MISSION_SWITCH_PIN, INPUT_PULLUP);

  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN, 400000);
  if (!initializeMPU()) {
    Serial.println("FATAL: MPU6050 not detected. Motors remain disabled.");
  } else {
    Serial.println("Keep the aircraft level and completely still: calibrating MPU6050...");
    imuCalibrated = calibrateMPU();
    Serial.println(imuCalibrated ? "MPU6050 calibration complete."
                                 : "MPU6050 calibration failed.");
  }

  Serial2.begin(9600, SERIAL_8N1, GPS_RX_PIN, GPS_TX_PIN);
  initializeEscOutputs();
  writeAllMotorsMinimum();

  if (ENABLE_CAMERA) {
    cameraHealthy = initializeCamera();
    if (cameraHealthy) {
      Serial.println("Camera initialized.");
    } else {
      Serial.println("WARNING: Camera initialization failed; flight core remains available.");
    }
  }

  setupNetworkServices();

  xTaskCreatePinnedToCore(flightTask, "Flight250Hz", 8192, nullptr, 3,
                          &flightTaskHandle, 0);
  if (ENABLE_CAMERA && cameraHealthy) {
    xTaskCreatePinnedToCore(cameraTask, "CameraAnalysis", 8192, nullptr, 1,
                            &cameraTaskHandle, 1);
  }
  xTaskCreatePinnedToCore(serviceTask, "CommandTelemetry", 6144, nullptr, 1,
                          &serviceTaskHandle, 1);

  printHelp();
}

void loop() {
  // FreeRTOS tasks own all runtime work.
  vTaskDelay(pdMS_TO_TICKS(1000));
}

// ============================== FLIGHT TASK ==================================

void flightTask(void *parameter) {
  (void)parameter;
  uint32_t nextWakeUs = micros();

