rushikesh81005-dev/autonomous-AI-powered-drone-for-SAR-mission-project-SAR-/SAR_Drone_ESP32_Direct_Controller.ino
  for (;;) {
    nextWakeUs += CONTROL_PERIOD_US;

    // Runtime calibration is performed only in this task, preventing a second
    // task from using Wire concurrently with the 250 Hz sensor reader.
    if (calibrationRequested && !motorsArmed) {
      calibrationRequested = false;
      imuCalibrated = false;
      imuCalibrated = calibrateMPU();
      Serial.println(imuCalibrated ? "Calibration complete." : "Calibration failed.");
      nextWakeUs = micros();
    }

    float ax, ay, az, gx, gy, gz;
    if (readMPU(ax, ay, az, gx, gy, gz)) {
      imuHealthy = true;
      updateAttitude(ax, ay, az, gx, gy, gz);
      updateVibrationMonitor(ax, ay, az);
    } else {
      imuHealthy = false;
      disarmMotors("IMU read failure");
    }

    parseGPS();
    updateMissionLogic();
    runFlightController();

    const int32_t remainingUs = (int32_t)(nextWakeUs - micros());
    if (remainingUs > 1000) {
      vTaskDelay(pdMS_TO_TICKS((remainingUs - 500) / 1000));
    }
    while ((int32_t)(nextWakeUs - micros()) > 0) {
      taskYIELD();
    }

    // If computation overruns badly, restart timing instead of chasing backlog.
    if ((int32_t)(micros() - nextWakeUs) > (int32_t)CONTROL_PERIOD_US) {
      nextWakeUs = micros();
    }
  }
}

// =============================== MPU6050 =====================================

bool initializeMPU() {
  Wire.beginTransmission(MPU_ADDR);
  Wire.write(0x75); // WHO_AM_I
  if (Wire.endTransmission(false) != 0) return false;
  if (Wire.requestFrom((int)MPU_ADDR, 1, true) != 1) return false;
  const uint8_t who = Wire.read();
  if (who != 0x68 && who != 0x69) return false;

  // Wake, select gyro PLL clock, configure DLPF and default full-scale ranges.
  const uint8_t registers[][2] = {
    {0x6B, 0x01}, // PWR_MGMT_1
    {0x1A, 0x03}, // DLPF ~44 Hz accel / ~42 Hz gyro
    {0x19, 0x03}, // internal 1 kHz / (1+3) = 250 Hz
    {0x1B, 0x00}, // gyro +/-250 dps
    {0x1C, 0x00}  // accel +/-2 g
  };

  for (const auto &entry : registers) {
    Wire.beginTransmission(MPU_ADDR);
    Wire.write(entry[0]);
    Wire.write(entry[1]);
    if (Wire.endTransmission() != 0) return false;
  }
  delay(100);
  return true;
}

bool calibrateMPU(uint16_t samples) {
  // readMPU() subtracts the existing bias. Clear it so repeated calibration
  // measures a new absolute bias instead of only the residual.
  gyroBiasX = gyroBiasY = gyroBiasZ = 0.0f;
  double sx = 0, sy = 0, sz = 0;
  uint16_t accepted = 0;
  for (uint16_t i = 0; i < samples; ++i) {
    float ax, ay, az, gx, gy, gz;
    if (readMPU(ax, ay, az, gx, gy, gz)) {
      sx += gx;
      sy += gy;
      sz += gz;
      ++accepted;
    }
    delay(2);
  }
  if (accepted < samples * 0.95f) return false;
  gyroBiasX = sx / accepted;
  gyroBiasY = sy / accepted;
  gyroBiasZ = sz / accepted;
  return true;
}

bool readMPU(float &ax, float &ay, float &az,
             float &gx, float &gy, float &gz) {
  Wire.beginTransmission(MPU_ADDR);
  Wire.write(0x3B);
  if (Wire.endTransmission(false) != 0) return false;
  if (Wire.requestFrom((int)MPU_ADDR, 14, true) != 14) return false;

  const int16_t rawAx = (Wire.read() << 8) | Wire.read();
  const int16_t rawAy = (Wire.read() << 8) | Wire.read();
  const int16_t rawAz = (Wire.read() << 8) | Wire.read();
  (void)((Wire.read() << 8) | Wire.read()); // temperature
  const int16_t rawGx = (Wire.read() << 8) | Wire.read();
  const int16_t rawGy = (Wire.read() << 8) | Wire.read();
  const int16_t rawGz = (Wire.read() << 8) | Wire.read();

  ax = ACCEL_X_SIGN * rawAx / 16384.0f;
  ay = ACCEL_Y_SIGN * rawAy / 16384.0f;
  az = ACCEL_Z_SIGN * rawAz / 16384.0f;
  gx = GYRO_X_SIGN * rawGx / 131.0f - gyroBiasX;
  gy = GYRO_Y_SIGN * rawGy / 131.0f - gyroBiasY;
  gz = GYRO_Z_SIGN * rawGz / 131.0f - gyroBiasZ;
  return true;
}

void updateAttitude(float ax, float ay, float az,
                    float gx, float gy, float gz) {
  static bool initialized = false;
  static float roll = 0, pitch = 0, yaw = 0;

  const float accelNorm = sqrtf(ax * ax + ay * ay + az * az);
  const bool accelTrustworthy = accelNorm > 0.75f && accelNorm < 1.25f;
  const float rollAcc = atan2f(ay, az) * RAD_TO_DEG;
  const float pitchAcc = atan2f(-ax, sqrtf(ay * ay + az * az)) * RAD_TO_DEG;

  if (!initialized) {
    roll = rollAcc;
    pitch = pitchAcc;
    yaw = 0.0f;
    initialized = true;
  } else {
    roll += gx * CONTROL_DT;
    pitch += gy * CONTROL_DT;
    yaw = wrap360(yaw + gz * CONTROL_DT);
    if (accelTrustworthy) {
      roll = COMPLEMENTARY_ALPHA * roll + (1.0f - COMPLEMENTARY_ALPHA) * rollAcc;
      pitch = COMPLEMENTARY_ALPHA * pitch + (1.0f - COMPLEMENTARY_ALPHA) * pitchAcc;
    }
  }

  if (yawResetRequested) {
    portENTER_CRITICAL(&stateMux);
    yaw = wrap360(requestedYawDeg);
    yawResetRequested = false;
    portEXIT_CRITICAL(&stateMux);
  }

  GPSData localGps;
  portENTER_CRITICAL(&stateMux);
  localGps = gps;
  portEXIT_CRITICAL(&stateMux);

  // GPS course is meaningful only while translating. Fuse it very slowly.
  if (localGps.courseValid && localGps.speedMps >= GPS_COURSE_MIN_MPS) {
    const float courseError = wrap180(localGps.courseDeg - yaw);
    yaw = wrap360(yaw + 0.02f * courseError);
    headingReferenceSet = true;
  }

  portENTER_CRITICAL(&stateMux);
  attitude.rollDeg = roll;
  attitude.pitchDeg = pitch;
  attitude.yawDeg = yaw;
  attitude.gxDps = gx;
  attitude.gyDps = gy;
  attitude.gzDps = gz;
  portEXIT_CRITICAL(&stateMux);
}

void updateVibrationMonitor(float ax, float ay, float az) {
  // Separate slow airframe motion/gravity from fast vibration, then maintain an
  // exponentially weighted RMS. Thresholds require airframe-specific testing.
  static bool ready = false;
  static float slowAx = 0, slowAy = 0, slowAz = 1;
  static float meanSquare = 0;
  static uint16_t highCount = 0;

  if (!ready) {
    slowAx = ax; slowAy = ay; slowAz = az;
    ready = true;
  }
  constexpr float slowAlpha = 0.02f;
  slowAx += slowAlpha * (ax - slowAx);
  slowAy += slowAlpha * (ay - slowAy);
  slowAz += slowAlpha * (az - slowAz);
  const float hx = ax - slowAx;
  const float hy = ay - slowAy;
  const float hz = az - slowAz;
  const float instantSquare = hx * hx + hy * hy + hz * hz;
  meanSquare = 0.98f * meanSquare + 0.02f * instantSquare;
  vibrationRmsG = sqrtf(meanSquare);

  if (!motorsArmed || commandedThrottleUs < 1200) {
    highCount = 0;
    vibrationAlert = false;
    return;
  }

  if (vibrationRmsG > 0.35f) {
    if (highCount < 1000) ++highCount;
  } else if (vibrationRmsG < 0.20f) {
    highCount = 0;
    vibrationAlert = false;
  }

  if (highCount >= 250 && !vibrationAlert) { // approximately one second
    vibrationAlert = true;
    Serial.printf("VIBRATION ALERT: high-frequency RMS %.3f g\n", vibrationRmsG);
    if (ENABLE_VIBRATION_RTH && homeLocked) mission = MissionState::RETURN_HOME;
  }
}

// =============================== ESC OUTPUT =================================

static uint32_t pulseToDuty(uint16_t pulseUs) {
  const uint32_t maxDuty = (1UL << ESC_PWM_BITS) - 1UL;
  const uint32_t periodUs = 1000000UL / ESC_PWM_HZ;
  return ((uint32_t)pulseUs * maxDuty) / periodUs;
}

void initializeEscOutputs() {
  const int pins[4] = {MOTOR_1_PIN, MOTOR_2_PIN, MOTOR_3_PIN, MOTOR_4_PIN};
  for (uint8_t i = 0; i < 4; ++i) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcAttachChannel(pins[i], ESC_PWM_HZ, ESC_PWM_BITS, MOTOR_CHANNEL[i]);
#else
    ledcSetup(MOTOR_CHANNEL[i], ESC_PWM_HZ, ESC_PWM_BITS);
    ledcAttachPin(pins[i], MOTOR_CHANNEL[i]);
#endif
    writeEscMicroseconds(i, ESC_MIN_US);
  }
  delay(3000); // allow standard PWM ESCs to recognize minimum throttle
}

void writeEscMicroseconds(uint8_t motor, uint16_t pulseUs) {
  if (motor >= 4) return;
  pulseUs = constrain(pulseUs, ESC_MIN_US, ESC_MAX_US);
  const uint32_t duty = pulseToDuty(pulseUs);
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWriteChannel(MOTOR_CHANNEL[motor], duty);
#else
  ledcWrite(MOTOR_CHANNEL[motor], duty);
#endif
}

