rushikesh81005-dev/autonomous-AI-powered-drone-for-SAR-mission-project-SAR-/SAR_Drone_ESP32_Direct_Controller.ino
void writeAllMotorsMinimum() {
  for (uint8_t i = 0; i < 4; ++i) writeEscMicroseconds(i, ESC_MIN_US);
}

void resetControllers() {
  AttitudeData a;
  portENTER_CRITICAL(&stateMux);
  a = attitude;
  portEXIT_CRITICAL(&stateMux);
  rollRatePID.reset(a.gxDps);
  pitchRatePID.reset(a.gyDps);
  yawRatePID.reset(a.gzDps);
}

bool armMotors() {
  if (BENCH_TEST_MODE) {
    Serial.println("BENCH mode: logical arming allowed, physical outputs remain at minimum.");
  }
  if (digitalRead(MISSION_SWITCH_PIN) != LOW) {
    Serial.println("ARM REFUSED: mission/arm switch must be LOW.");
    return false;
  }
  if (!imuHealthy || !imuCalibrated) {
    Serial.println("ARM REFUSED: IMU is not healthy and calibrated.");
    return false;
  }
  AttitudeData a;
  portENTER_CRITICAL(&stateMux);
  a = attitude;
  portEXIT_CRITICAL(&stateMux);
  if (fabsf(a.rollDeg) > 10.0f || fabsf(a.pitchDeg) > 10.0f) {
    Serial.println("ARM REFUSED: aircraft must be level within 10 degrees.");
    return false;
  }
  commandedThrottleUs = ESC_MIN_US;
  resetControllers();
  motorsArmed = true;
  mission = MissionState::STABILIZE;
  Serial.println("LOGIC ARMED. Raise THR gradually only during a controlled test.");
  return true;
}

void disarmMotors(const char *reason) {
  const bool wasArmed = motorsArmed;
  motorsArmed = false;
  mission = MissionState::DISARMED;
  commandedThrottleUs = ESC_MIN_US;
  writeAllMotorsMinimum();
  resetControllers();
  if (wasArmed && reason) Serial.printf("DISARMED: %s\n", reason);
}

void computeMotorMix(float throttleUs, float rollCorrection,
                     float pitchCorrection, float yawCorrection) {
  // Positive roll correction raises left motors. Positive pitch correction
  // raises rear motors. Positive yaw correction raises CCW rotors (M1/M3).
  float correction[4];
  correction[0] =  rollCorrection - pitchCorrection + yawCorrection;
  correction[1] = -rollCorrection - pitchCorrection - yawCorrection;
  correction[2] = -rollCorrection + pitchCorrection + yawCorrection;
  correction[3] =  rollCorrection + pitchCorrection - yawCorrection;

  float highest = correction[0], lowest = correction[0];
  for (uint8_t i = 1; i < 4; ++i) {
    highest = max(highest, correction[i]);
    lowest = min(lowest, correction[i]);
  }

  // If the requested differential is wider than the ESC's usable range,
  // scale all corrections together so roll/pitch/yaw proportions are retained.
  const float availableRange = ESC_MAX_US - ESC_IDLE_US;
  const float correctionSpan = highest - lowest;
  if (correctionSpan > availableRange) {
    const float scale = availableRange / correctionSpan;
    for (float &value : correction) value *= scale;
    highest *= scale;
    lowest *= scale;
  }

  // Choose the closest feasible common throttle while preserving differential.
  const float minimumBase = ESC_IDLE_US - lowest;
  const float maximumBase = ESC_MAX_US - highest;
  const float feasibleThrottle = constrain(throttleUs, minimumBase, maximumBase);
  for (uint8_t i = 0; i < 4; ++i) {
    computedMotorUs[i] = (uint16_t)constrain(feasibleThrottle + correction[i],
                                                    (float)ESC_IDLE_US,
                                                    (float)ESC_MAX_US);
  }
}

void runFlightController() {
  if (!motorsArmed || mission == MissionState::DISARMED ||
      mission == MissionState::EMERGENCY_STOP) {
    writeAllMotorsMinimum();
    return;
  }

  // The physical switch is a hard, continuously checked permission input.
  if (digitalRead(MISSION_SWITCH_PIN) != LOW) {
    disarmMotors("physical arm switch opened");
    return;
  }

  AttitudeData a;
  portENTER_CRITICAL(&stateMux);
  a = attitude;
  portEXIT_CRITICAL(&stateMux);

  if (fabsf(a.rollDeg) > EMERGENCY_TILT_DEG ||
      fabsf(a.pitchDeg) > EMERGENCY_TILT_DEG) {
    mission = MissionState::EMERGENCY_STOP;
    disarmMotors("extreme tilt detected");
    return;
  }

  const float rollRateSetpoint = constrain(
      rollAngleKp * (desiredRollDeg - a.rollDeg),
      -MAX_ANGLE_RATE_DPS, MAX_ANGLE_RATE_DPS);
  const float pitchRateSetpoint = constrain(
      pitchAngleKp * (desiredPitchDeg - a.pitchDeg),
      -MAX_ANGLE_RATE_DPS, MAX_ANGLE_RATE_DPS);

  const float rollCorrection = rollRatePID.update(
      rollRateSetpoint, a.gxDps, CONTROL_DT);
  const float pitchCorrection = pitchRatePID.update(
      pitchRateSetpoint, a.gyDps, CONTROL_DT);
  const float yawCorrection = yawRatePID.update(
      desiredYawRateDps, a.gzDps, CONTROL_DT);

  const float throttle = constrain(commandedThrottleUs,
                                   (float)ESC_MIN_US,
                                   (float)THROTTLE_MAX_US);
  if (throttle < ESC_IDLE_US) {
    writeAllMotorsMinimum();
    resetControllers();
    return;
  }

  computeMotorMix(throttle, rollCorrection, pitchCorrection, yawCorrection);
  for (uint8_t i = 0; i < 4; ++i) {
    writeEscMicroseconds(i, BENCH_TEST_MODE ? ESC_MIN_US : computedMotorUs[i]);
  }
}

// ================================= GPS =======================================

void parseGPS() {
  static char line[128];
  static uint8_t length = 0;

  while (Serial2.available()) {
    const char c = (char)Serial2.read();
    if (c == '\n') {
      line[length] = '\0';
      if (length > 6) parseNMEALine(line);
      length = 0;
    } else if (c != '\r') {
      if (length < sizeof(line) - 1) line[length++] = c;
      else length = 0; // discard overlong/corrupt sentence
    }
  }
}

bool validateNMEAChecksum(const char *line) {
  if (!line || line[0] != '$') return false;
  const char *star = strchr(line, '*');
  if (!star || strlen(star) < 3) return false;
  uint8_t checksum = 0;
  for (const char *p = line + 1; p < star; ++p) checksum ^= (uint8_t)*p;
  const uint8_t expected = (uint8_t)strtoul(star + 1, nullptr, 16);
  return checksum == expected;
}

double nmeaCoordinateToDegrees(const char *field, bool longitude) {
  if (!field || !*field) return 0.0;
  const uint8_t degreeDigits = longitude ? 3 : 2;
  char degreePart[4] = {0};
  strncpy(degreePart, field, degreeDigits);
  const double degrees = atof(degreePart);
  const double minutes = atof(field + degreeDigits);
  return degrees + minutes / 60.0;
}

bool parseNMEALine(char *line) {
  if (!validateNMEAChecksum(line)) return false;
  char copy[128];
  strncpy(copy, line, sizeof(copy) - 1);
  copy[sizeof(copy) - 1] = '\0';
  char *star = strchr(copy, '*');
  if (star) *star = '\0';

  // Preserve empty NMEA fields. strtok_r() would silently remove them and
  // shift every subsequent field number.
  char *fields[16] = {nullptr};
  uint8_t count = 1;
  fields[0] = copy;
  for (char *p = copy; *p && count < 16; ++p) {
    if (*p == ',') {
      *p = '\0';
      fields[count++] = p + 1;
    }
  }
  if (count < 2) return false;

  GPSData updated;
  portENTER_CRITICAL(&stateMux);
  updated = gps;
  portEXIT_CRITICAL(&stateMux);

  if (!strcmp(fields[0], "$GPGGA") || !strcmp(fields[0], "$GNGGA")) {
    if (count < 8) return false;
    const int fixQuality = atoi(fields[6]);
    updated.fix = fixQuality > 0;
    updated.satellites = (uint8_t)atoi(fields[7]);
    if (updated.fix && fields[2] && fields[3] && fields[4] && fields[5]) {
      updated.lat = nmeaCoordinateToDegrees(fields[2], false);
      updated.lng = nmeaCoordinateToDegrees(fields[4], true);
      if (fields[3][0] == 'S') updated.lat = -updated.lat;
      if (fields[5][0] == 'W') updated.lng = -updated.lng;
      updated.lastFixMs = millis();
    }
  } else if (!strcmp(fields[0], "$GPRMC") || !strcmp(fields[0], "$GNRMC")) {
    if (count < 9) return false;
    if (fields[2] && fields[2][0] == 'A') {
      updated.fix = true;
      updated.lat = nmeaCoordinateToDegrees(fields[3], false);
      updated.lng = nmeaCoordinateToDegrees(fields[5], true);
      if (fields[4][0] == 'S') updated.lat = -updated.lat;
      if (fields[6][0] == 'W') updated.lng = -updated.lng;
      updated.speedMps = atof(fields[7]) * 0.514444f; // knots -> m/s
      updated.courseDeg = wrap360(atof(fields[8]));
      updated.courseValid = updated.speedMps >= GPS_COURSE_MIN_MPS;
      updated.lastFixMs = millis();
    }
  } else {
    return false;
  }

  portENTER_CRITICAL(&stateMux);
  gps = updated;
  portEXIT_CRITICAL(&stateMux);
  return true;
}

double distanceMeters(double lat1, double lon1, double lat2, double lon2) {
  constexpr double earthRadiusM = 6371000.0;
  const double p1 = lat1 * DEG_TO_RAD;
  const double p2 = lat2 * DEG_TO_RAD;
  const double dp = (lat2 - lat1) * DEG_TO_RAD;
  const double dl = (lon2 - lon1) * DEG_TO_RAD;
  const double a = sin(dp / 2) * sin(dp / 2) +
                   cos(p1) * cos(p2) * sin(dl / 2) * sin(dl / 2);
  return earthRadiusM * 2.0 * atan2(sqrt(a), sqrt(1.0 - a));
}

float bearingDegrees(double lat1, double lon1, double lat2, double lon2) {
  const double p1 = lat1 * DEG_TO_RAD;
  const double p2 = lat2 * DEG_TO_RAD;
  const double dl = (lon2 - lon1) * DEG_TO_RAD;
  const double y = sin(dl) * cos(p2);
  const double x = cos(p1) * sin(p2) - sin(p1) * cos(p2) * cos(dl);
  return wrap360(atan2(y, x) * RAD_TO_DEG);
}

float wrap180(float angle) {
  while (angle > 180.0f) angle -= 360.0f;
  while (angle < -180.0f) angle += 360.0f;
  return angle;
}

float wrap360(float angle) {
  while (angle >= 360.0f) angle -= 360.0f;
  while (angle < 0.0f) angle += 360.0f;
  return angle;
}

