rushikesh81005-dev/autonomous-AI-powered-drone-for-SAR-mission-project-SAR-/SAR_Drone_ESP32_Direct_Controller.ino
// ============================= MISSION LOGIC =================================

void updateMissionLogic() {
  GPSData g;
  portENTER_CRITICAL(&stateMux);
  g = gps;
  portEXIT_CRITICAL(&stateMux);

  if (!homeLocked && g.fix && g.satellites >= 6 &&
      millis() - g.lastFixMs < GPS_TIMEOUT_MS) {
    portENTER_CRITICAL(&stateMux);
    homeLat = g.lat;
    homeLng = g.lng;
    homeLocked = true;
    portEXIT_CRITICAL(&stateMux);
    Serial.printf("HOME LOCKED: %.7f, %.7f\n", g.lat, g.lng);
  }

  if (motorsArmed &&
      (mission == MissionState::FLY_TO_WAYPOINT ||
       mission == MissionState::RETURN_HOME ||
       mission == MissionState::SURVEY_GRID) &&
      (!g.fix || millis() - g.lastFixMs > GPS_TIMEOUT_MS)) {
    mission = MissionState::GPS_FAILSAFE_HOLD;
    desiredRollDeg = 0;
    desiredPitchDeg = 0;
    desiredYawRateDps = 0;
  }

  if (obstacleBrakeRequested &&
      (mission == MissionState::FLY_TO_WAYPOINT ||
       mission == MissionState::SURVEY_GRID)) {
    mission = MissionState::OBSTACLE_BRAKE;
  }

  updateNavigationSetpoints();
}

void updateNavigationSetpoints() {
  desiredRollDeg = 0.0f;
  desiredPitchDeg = 0.0f;
  desiredYawRateDps = 0.0f;

  if (mission == MissionState::STABILIZE ||
      mission == MissionState::OBSTACLE_BRAKE ||
      mission == MissionState::GPS_FAILSAFE_HOLD) {
    return;
  }

  if (mission == MissionState::RETURN_HOME) {
    double hLat, hLng;
    bool hasHome;
    portENTER_CRITICAL(&stateMux);
    hasHome = homeLocked;
    hLat = homeLat;
    hLng = homeLng;
    portEXIT_CRITICAL(&stateMux);
    if (!hasHome) {
      mission = MissionState::GPS_FAILSAFE_HOLD;
      return;
    }
    portENTER_CRITICAL(&stateMux);
    targetLat = hLat;
    targetLng = hLng;
    targetValid = true;
    portEXIT_CRITICAL(&stateMux);
  }

  if (mission != MissionState::FLY_TO_WAYPOINT &&
      mission != MissionState::RETURN_HOME &&
      mission != MissionState::SURVEY_GRID) return;

  GPSData g;
  AttitudeData a;
  portENTER_CRITICAL(&stateMux);
  g = gps;
  a = attitude;
  portEXIT_CRITICAL(&stateMux);

  double localTargetLat, localTargetLng;
  bool hasTarget;
  portENTER_CRITICAL(&stateMux);
  hasTarget = targetValid;
  localTargetLat = targetLat;
  localTargetLng = targetLng;
  portEXIT_CRITICAL(&stateMux);
  if (!g.fix || !hasTarget || !headingReferenceSet) return;

  const double distance = distanceMeters(g.lat, g.lng,
                                         localTargetLat, localTargetLng);
  const float bearing = bearingDegrees(g.lat, g.lng,
                                       localTargetLat, localTargetLng);
  const float headingError = wrap180(bearing - a.yawDeg);

  desiredYawRateDps = constrain(headingError * 1.3f, -70.0f, 70.0f);
  const float alignment = max(0.0f, cosf(headingError * DEG_TO_RAD));
  desiredPitchDeg = NAV_FORWARD_PITCH_DEG * alignment *
                    constrain((float)(distance / 25.0), 0.25f, 1.0f);
  // Small course-error bank aids the turn; yaw remains the primary command.
  desiredRollDeg = constrain(headingError * 0.08f,
                             -NAV_MAX_ROLL_DEG, NAV_MAX_ROLL_DEG);

  if (distance <= WAYPOINT_RADIUS_M) {
    if (mission == MissionState::SURVEY_GRID) {
      advanceSurveyWaypoint();
    } else {
      mission = MissionState::STABILIZE;
      desiredRollDeg = desiredPitchDeg = desiredYawRateDps = 0;
      Serial.println("Waypoint reached; switching to level stabilization.");
    }
  }
}

bool configureSurvey(double originLat, double originLng,
                     float sideKm, float spacingKm) {
  if (sideKm <= 0 || sideKm > 50.0f || spacingKm <= 0 || spacingKm > sideKm)
    return false;

  SurveyPlan newPlan;
  newPlan.originLat = originLat;
  newPlan.originLng = originLng;
  newPlan.sideKm = sideKm;
  newPlan.spacingKm = spacingKm;
  newPlan.pointsPerLine = (uint16_t)ceilf(sideKm / spacingKm) + 1;
  newPlan.lineCount = newPlan.pointsPerLine;
  newPlan.waypointCount = (uint32_t)newPlan.pointsPerLine * newPlan.lineCount;
  newPlan.waypointIndex = 0;
  newPlan.valid = true;

  portENTER_CRITICAL(&stateMux);
  survey = newPlan;
  targetLat = originLat;
  targetLng = originLng;
  targetValid = true;
  portEXIT_CRITICAL(&stateMux);
  return true;
}

bool surveyWaypoint(uint32_t index, double &lat, double &lng) {
  SurveyPlan plan;
  portENTER_CRITICAL(&stateMux);
  plan = survey;
  portEXIT_CRITICAL(&stateMux);
  if (!plan.valid || index >= plan.waypointCount) return false;
  const uint32_t line = index / plan.pointsPerLine;
  const uint32_t position = index % plan.pointsPerLine;
  const float northKm = min(line * plan.spacingKm, plan.sideKm);
  float eastKm = min(position * plan.spacingKm, plan.sideKm);
  if (line & 1U) eastKm = plan.sideKm - eastKm;

  lat = plan.originLat + northKm / 111.32;
  const double cosLat = cos(plan.originLat * DEG_TO_RAD);
  if (fabs(cosLat) < 0.01) return false;
  lng = plan.originLng + eastKm / (111.32 * cosLat);
  return true;
}

void advanceSurveyWaypoint() {
  uint32_t nextIndex, count;
  portENTER_CRITICAL(&stateMux);
  nextIndex = ++survey.waypointIndex;
  count = survey.waypointCount;
  if (nextIndex >= count) survey.valid = false;
  portEXIT_CRITICAL(&stateMux);

  if (nextIndex >= count) {
    mission = MissionState::RETURN_HOME;
    Serial.println("Survey complete; selecting return-home target.");
    return;
  }
  double nextLat, nextLng;
  if (!surveyWaypoint(nextIndex, nextLat, nextLng)) {
    mission = MissionState::GPS_FAILSAFE_HOLD;
    return;
  }
  portENTER_CRITICAL(&stateMux);
  targetLat = nextLat;
  targetLng = nextLng;
  targetValid = true;
  portEXIT_CRITICAL(&stateMux);
  Serial.printf("Survey waypoint %lu/%lu: %.7f, %.7f\n",
                (unsigned long)(nextIndex + 1),
                (unsigned long)count,
                nextLat, nextLng);
}

// ============================== CAMERA TASK ==================================

bool initializeCamera() {
  camera_config_t config = {};
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;
  config.pin_d0 = CAM_D0;
  config.pin_d1 = CAM_D1;
  config.pin_d2 = CAM_D2;
  config.pin_d3 = CAM_D3;
  config.pin_d4 = CAM_D4;
  config.pin_d5 = CAM_D5;
  config.pin_d6 = CAM_D6;
  config.pin_d7 = CAM_D7;
  config.pin_xclk = CAM_XCLK;
  config.pin_pclk = CAM_PCLK;
  config.pin_vsync = CAM_VSYNC;
  config.pin_href = CAM_HREF;
  config.pin_sccb_sda = I2C_SDA_PIN;
  config.pin_sccb_scl = I2C_SCL_PIN;
  config.pin_pwdn = -1;
  config.pin_reset = -1;
  config.xclk_freq_hz = 20000000;
  config.pixel_format = PIXFORMAT_GRAYSCALE;
  config.frame_size = FRAMESIZE_QQVGA; // 160 x 120
  config.jpeg_quality = 15;
  config.fb_count = 1;
#if defined(CAMERA_GRAB_WHEN_EMPTY)
  config.grab_mode = CAMERA_GRAB_WHEN_EMPTY;
#endif
#if defined(CAMERA_FB_IN_DRAM)
  config.fb_location = CAMERA_FB_IN_DRAM;
#endif
  esp_err_t error = esp_camera_init(&config);
  if (error == ESP_OK) return true;

  // OV7670 is documented primarily with YUV/RGB output. Some driver versions
  // accept direct grayscale and others do not. Retry in YUV422 and extract Y.
  esp_camera_deinit();
  delay(50);
  config.pixel_format = PIXFORMAT_YUV422;
  error = esp_camera_init(&config);
  if (error == ESP_OK) {
    Serial.println("Camera grayscale unavailable; using YUV422 luminance fallback.");
    return true;
  }
  return false;
}

void cameraTask(void *parameter) {
  (void)parameter;
  for (;;) {
    camera_fb_t *frame = esp_camera_fb_get();
    if (frame &&
        (frame->format == PIXFORMAT_GRAYSCALE ||
         frame->format == PIXFORMAT_YUV422) &&
        frame->width == 160 && frame->height == 120) {
      analyzeCameraFrame(frame);
    }
    if (frame) esp_camera_fb_return(frame);
    vTaskDelay(pdMS_TO_TICKS(80)); // ~12.5 analysis frames/s
  }
}

uint8_t frameLuminance(const camera_fb_t *frame, int pixelIndex) {
  if (!frame || pixelIndex < 0) return 0;
  if (frame->format == PIXFORMAT_GRAYSCALE) {
    if ((size_t)pixelIndex >= frame->len) return 0;
    return frame->buf[pixelIndex];
  }
  // The esp32-camera YUV422 buffer uses two bytes per pixel with luma in the
  // even byte of each pixel pair representation used by the driver.
  const size_t byteIndex = (size_t)pixelIndex * 2U;
  if (byteIndex >= frame->len) return 0;
  return frame->buf[byteIndex];
}

