rushikesh81005-dev/autonomous-AI-powered-drone-for-SAR-mission-project-SAR-/SAR_Drone_ESP32_Direct_Controller.ino
void analyzeCameraFrame(camera_fb_t *frame) {
  // Lightweight background-difference candidate detector. It deliberately
  // does not claim identity, range, or thermal detection.
  static uint8_t background[160 * 120];
  static bool backgroundReady = false;
  static uint8_t candidatePersistence = 0;
  static uint32_t lastReportMs = 0;
  static long previousDarkCount = 0;
  static int previousCenterX = 80;
  static int previousCenterY = 60;

  if (!backgroundReady) {
    for (int i = 0; i < 160 * 120; ++i) {
      background[i] = frameLuminance(frame, i);
    }
    backgroundReady = true;
    return;
  }

  int minX = 159, maxX = 0, minY = 119, maxY = 0;
  uint32_t changed = 0;
  uint32_t darkCount = 0;
  uint32_t sumDarkX = 0, sumDarkY = 0;

  for (int y = 0; y < 120; y += 2) {
    for (int x = 0; x < 160; x += 2) {
      const int index = y * 160 + x;
      const uint8_t pixel = frameLuminance(frame, index);
      const uint8_t bg = background[index];
      if (abs((int)pixel - (int)bg) > 35) {
        ++changed;
        minX = min(minX, x); maxX = max(maxX, x);
        minY = min(minY, y); maxY = max(maxY, y);
      }
      if (pixel < 55) {
        ++darkCount;
        sumDarkX += x;
        sumDarkY += y;
      }
      // Slow IIR background adaptation: 31/32 old + 1/32 new.
      background[index] = (uint8_t)(((uint16_t)bg * 31U + pixel) >> 5);
    }
  }

  bool candidate = false;
  if (changed >= 70 && changed <= 1400 && maxX > minX && maxY > minY) {
    const float width = maxX - minX + 1;
    const float height = maxY - minY + 1;
    const float aspect = height / width;
    const float sampledBoxArea = (width * height) / 4.0f;
    const float fill = changed / max(1.0f, sampledBoxArea);
    candidate = aspect >= 1.15f && aspect <= 4.5f &&
                fill >= 0.12f && fill <= 0.90f;
  }

  candidatePersistence = candidate ? min(20, candidatePersistence + 1)
                                   : max(0, candidatePersistence - 1);
  if (candidatePersistence >= 6 && millis() - lastReportMs > 15000) {
    visualCandidateConfirmed = true;
    reportVisualCandidate();
    lastReportMs = millis();
    candidatePersistence = 0;
  }

  if (ENABLE_GESTURE_COMMANDS && darkCount > 300) {
    const int centerX = sumDarkX / darkCount;
    const int centerY = sumDarkY / darkCount;
    const int dx = centerX - previousCenterX;
    const int dy = centerY - previousCenterY;
    const long dArea = (long)darkCount - previousDarkCount;

    if (darkCount > 850 && abs(dx) < 8 && abs(dy) < 8) {
      obstacleBrakeRequested = true;
    } else if (dx < -20) {
      obstacleBrakeRequested = false;
      if (mission == MissionState::OBSTACLE_BRAKE)
        mission = MissionState::STABILIZE;
    } else if (dx > 20) {
      if (homeLocked) mission = MissionState::RETURN_HOME;
    }
    (void)dArea; // retained for future near/far gesture validation
    previousCenterX = centerX;
    previousCenterY = centerY;
    previousDarkCount = darkCount;
  } else if (darkCount <= 300) {
    previousDarkCount = 0;
  }
}

void reportVisualCandidate() {
  GPSData g;
  portENTER_CRITICAL(&stateMux);
  g = gps;
  portEXIT_CRITICAL(&stateMux);
  Serial.println("VISUAL CANDIDATE: persistent person-like moving region detected.");
  if (g.fix) {
    Serial.printf("Drone GPS at observation: %.7f, %.7f (not survivor range-fix)\n",
                  g.lat, g.lng);
    if (ENABLE_UDP_TELEMETRY && udpServiceReady &&
        WiFi.status() == WL_CONNECTED) {
      char alert[160];
      snprintf(alert, sizeof(alert),
               "ALERT=VISUAL_CANDIDATE,LAT=%.7f,LON=%.7f,"
               "COORDINATE_TYPE=DRONE_OBSERVATION",
               g.lat, g.lng);
      telemetryUdp.beginPacket(BASE_IP, TELEMETRY_PORT);
      telemetryUdp.print(alert);
      telemetryUdp.endPacket();
    }
  } else {
    Serial.println("No current GPS fix available for this observation.");
  }
  sendTelemetry();
}

// ========================== COMMANDS / TELEMETRY ============================

void serviceTask(void *parameter) {
  (void)parameter;
  uint32_t lastTelemetryMs = 0;
  for (;;) {
    processSerialCommands();
    if (WiFi.status() == WL_CONNECTED) {
      if (ENABLE_WIFI_OTA && !otaServiceReady) {
        ArduinoOTA.begin();
        otaServiceReady = true;
        Serial.println("OTA service ready while disarmed.");
      }
      if (ENABLE_UDP_TELEMETRY && !udpServiceReady) {
        telemetryUdp.begin(TELEMETRY_PORT);
        udpServiceReady = true;
      }
      // Do not even service an update request while motors are logically armed.
      if (ENABLE_WIFI_OTA && otaServiceReady && !motorsArmed) ArduinoOTA.handle();
    }
    if (millis() - lastTelemetryMs >= 1000) {
      sendTelemetry();
      lastTelemetryMs = millis();
    }
    vTaskDelay(pdMS_TO_TICKS(10));
  }
}

void setupNetworkServices() {
  if (!ENABLE_WIFI_OTA && !ENABLE_UDP_TELEMETRY) return;
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  if (ENABLE_WIFI_OTA) {
    ArduinoOTA.setHostname("sar-esp32-drone");
    ArduinoOTA.setPassword(OTA_PASSWORD);
    ArduinoOTA.onStart([]() {
      disarmMotors("OTA update requested");
      Serial.println("OTA update starting; motors locked.");
    });
    ArduinoOTA.onEnd([]() { Serial.println("OTA update complete."); });
  }
}

const char *missionName(MissionState state) {
  switch (state) {
    case MissionState::DISARMED: return "DISARMED";
    case MissionState::STABILIZE: return "STABILIZE";
    case MissionState::FLY_TO_WAYPOINT: return "WAYPOINT";
    case MissionState::RETURN_HOME: return "RTH";
    case MissionState::OBSTACLE_BRAKE: return "BRAKE";
    case MissionState::SURVEY_GRID: return "SURVEY";
    case MissionState::GPS_FAILSAFE_HOLD: return "GPS_FAILSAFE";
    case MissionState::EMERGENCY_STOP: return "EMERGENCY";
  }
  return "UNKNOWN";
}

void sendTelemetry() {
  GPSData g;
  AttitudeData a;
  portENTER_CRITICAL(&stateMux);
  g = gps;
  a = attitude;
  portEXIT_CRITICAL(&stateMux);

  char packet[300];
  snprintf(packet, sizeof(packet),
           "STATE=%s,ARM=%u,BENCH=%u,R=%.2f,P=%.2f,Y=%.2f,"
           "GPS=%u,SAT=%u,LAT=%.7f,LON=%.7f,SPD=%.2f,THR=%.0f,"
           "M=%u/%u/%u/%u,CANDIDATE=%u,VIB_RMS=%.3f,VIB_ALERT=%u",
           missionName(mission), motorsArmed, BENCH_TEST_MODE,
           a.rollDeg, a.pitchDeg, a.yawDeg,
           g.fix, g.satellites, g.lat, g.lng, g.speedMps,
           commandedThrottleUs,
           computedMotorUs[0], computedMotorUs[1],
           computedMotorUs[2], computedMotorUs[3],
           visualCandidateConfirmed, vibrationRmsG, vibrationAlert);

