rushikesh81005-dev/autonomous-AI-powered-drone-for-SAR-mission-project-SAR-/SAR_Drone_ESP32_Direct_Controller.ino
  if (ENABLE_UDP_TELEMETRY && udpServiceReady &&
      WiFi.status() == WL_CONNECTED) {
    telemetryUdp.beginPacket(BASE_IP, TELEMETRY_PORT);
    telemetryUdp.print(packet);
    telemetryUdp.endPacket();
  }
}

void printStatus() {
  GPSData g;
  AttitudeData a;
  double hLat, hLng;
  bool hasHome;
  portENTER_CRITICAL(&stateMux);
  g = gps;
  a = attitude;
  hLat = homeLat;
  hLng = homeLng;
  hasHome = homeLocked;
  portEXIT_CRITICAL(&stateMux);

  Serial.println("---------------- STATUS ----------------");
  Serial.printf("State: %s | logical arm: %s | bench lock: %s\n",
                missionName(mission), motorsArmed ? "YES" : "NO",
                BENCH_TEST_MODE ? "ON" : "OFF");
  Serial.printf("IMU: healthy=%u calibrated=%u | R/P/Y: %.2f %.2f %.2f deg\n",
                imuHealthy, imuCalibrated, a.rollDeg, a.pitchDeg, a.yawDeg);
  Serial.printf("Rates: %.2f %.2f %.2f dps | desired: %.2f %.2f yawRate %.2f\n",
                a.gxDps, a.gyDps, a.gzDps,
                desiredRollDeg, desiredPitchDeg, desiredYawRateDps);
  Serial.printf("GPS: fix=%u satellites=%u lat=%.7f lng=%.7f speed=%.2f m/s\n",
                g.fix, g.satellites, g.lat, g.lng, g.speedMps);
  Serial.printf("Home: %s %.7f %.7f | Heading reference: %s\n",
                hasHome ? "LOCKED" : "NOT LOCKED", hLat, hLng,
                headingReferenceSet ? "SET" : "NOT SET");
  Serial.printf("Throttle: %.0f | computed motors: %u %u %u %u\n",
                commandedThrottleUs, computedMotorUs[0], computedMotorUs[1],
                computedMotorUs[2], computedMotorUs[3]);
  Serial.printf("Vibration RMS: %.3f g | alert: %s | automatic RTH: %s\n",
                vibrationRmsG, vibrationAlert ? "YES" : "NO",
                ENABLE_VIBRATION_RTH ? "ENABLED" : "DISABLED");
  Serial.println("----------------------------------------");
}

void printHelp() {
  Serial.println("Commands (newline terminated):");
  Serial.println("  STATUS");
  Serial.println("  ARM 7319       - requires physical switch LOW; bench lock remains active");
  Serial.println("  DISARM");
  Serial.println("  CALIBRATE      - disarmed, level and completely still");
  Serial.println("  THR 1000..1750 - open-loop throttle; there is no altitude hold");
  Serial.println("  YAW degrees    - manually establish north-referenced yaw");
  Serial.println("  WP lat lon     - set a waypoint");
  Serial.println("  STARTWP        - start waypoint mission after logical arm");
  Serial.println("  SURVEY lat lon side_km spacing_km");
  Serial.println("  STARTSURVEY");
  Serial.println("  RTH | BRAKE | RESUME");
  Serial.println("  PIDR kp ki kd | PIDP kp ki kd | PIDY kp ki kd");
  Serial.println("  HELP");
}

void processSerialCommands() {
  static char buffer[128];
  static uint8_t length = 0;
  while (Serial.available()) {
    const char c = (char)Serial.read();
    if (c == '\n' || c == '\r') {
      if (length == 0) continue;
      buffer[length] = '\0';
      length = 0;

      if (!strcmp(buffer, "STATUS")) {
        printStatus();
      } else if (!strcmp(buffer, "HELP")) {
        printHelp();
      } else if (!strcmp(buffer, "DISARM")) {
        disarmMotors("operator command");
      } else if (!strcmp(buffer, "ARM 7319")) {
        armMotors();
      } else if (!strcmp(buffer, "CALIBRATE")) {
        if (motorsArmed) Serial.println("Calibration refused while armed.");
        else {
          calibrationRequested = true;
          Serial.println("Calibration requested; keep aircraft level and still.");
        }
      } else if (!strcmp(buffer, "RTH")) {
        if (motorsArmed && homeLocked) mission = MissionState::RETURN_HOME;
        else Serial.println("RTH refused: logical arm and home lock required.");
      } else if (!strcmp(buffer, "BRAKE")) {
        obstacleBrakeRequested = true;
        mission = MissionState::OBSTACLE_BRAKE;
      } else if (!strcmp(buffer, "RESUME")) {
        obstacleBrakeRequested = false;
        mission = motorsArmed ? MissionState::STABILIZE : MissionState::DISARMED;
      } else if (!strcmp(buffer, "STARTWP")) {
        GPSData g;
        portENTER_CRITICAL(&stateMux); g = gps; portEXIT_CRITICAL(&stateMux);
        if (motorsArmed && targetValid && g.fix && headingReferenceSet)
          mission = MissionState::FLY_TO_WAYPOINT;
        else
          Serial.println("STARTWP refused: arm, target, GPS and heading reference required.");
      } else if (!strcmp(buffer, "STARTSURVEY")) {
        GPSData g;
        portENTER_CRITICAL(&stateMux); g = gps; portEXIT_CRITICAL(&stateMux);
        if (motorsArmed && survey.valid && g.fix && headingReferenceSet)
          mission = MissionState::SURVEY_GRID;
        else
          Serial.println("STARTSURVEY refused: arm, survey, GPS and heading reference required.");
      } else {
        float value;
        double lat, lng;
        float sideKm, spacingKm;
        float kp, ki, kd;
        if (sscanf(buffer, "THR %f", &value) == 1) {
          commandedThrottleUs = constrain(value, (float)ESC_MIN_US,
                                          (float)THROTTLE_MAX_US);
          Serial.printf("Open-loop throttle set to %.0f us.\n", commandedThrottleUs);
        } else if (sscanf(buffer, "YAW %f", &value) == 1) {
          if (motorsArmed) {
            Serial.println("YAW reset refused while armed.");
          } else {
            portENTER_CRITICAL(&stateMux);
            requestedYawDeg = wrap360(value);
            yawResetRequested = true;
            portEXIT_CRITICAL(&stateMux);
            headingReferenceSet = true;
            Serial.printf("Yaw reference set to %.1f degrees.\n", wrap360(value));
          }
        } else if (sscanf(buffer, "WP %lf %lf", &lat, &lng) == 2) {
          if (lat >= -90 && lat <= 90 && lng >= -180 && lng <= 180) {
            portENTER_CRITICAL(&stateMux);
            targetLat = lat;
            targetLng = lng;
            targetValid = true;
            portEXIT_CRITICAL(&stateMux);
            Serial.printf("Waypoint set: %.7f, %.7f\n", lat, lng);
          } else Serial.println("Invalid waypoint coordinates.");
        } else if (sscanf(buffer, "SURVEY %lf %lf %f %f",
                          &lat, &lng, &sideKm, &spacingKm) == 4) {
          if (motorsArmed) {
            Serial.println("Survey reconfiguration refused while armed.");
          } else if (configureSurvey(lat, lng, sideKm, spacingKm))
            Serial.printf("Survey configured: %lu waypoints.\n",
                          (unsigned long)survey.waypointCount);
          else Serial.println("Invalid survey parameters.");
        } else if (sscanf(buffer, "PIDR %f %f %f", &kp, &ki, &kd) == 3) {
          if (motorsArmed || kp < 0 || ki < 0 || kd < 0)
            Serial.println("PID update refused: disarm and use non-negative gains.");
          else {
            rollRatePID.kp = kp; rollRatePID.ki = ki; rollRatePID.kd = kd;
            rollRatePID.reset(); Serial.println("Roll-rate PID updated.");
          }
        } else if (sscanf(buffer, "PIDP %f %f %f", &kp, &ki, &kd) == 3) {
          if (motorsArmed || kp < 0 || ki < 0 || kd < 0)
            Serial.println("PID update refused: disarm and use non-negative gains.");
          else {
            pitchRatePID.kp = kp; pitchRatePID.ki = ki; pitchRatePID.kd = kd;
            pitchRatePID.reset(); Serial.println("Pitch-rate PID updated.");
          }
        } else if (sscanf(buffer, "PIDY %f %f %f", &kp, &ki, &kd) == 3) {
          if (motorsArmed || kp < 0 || ki < 0 || kd < 0)
            Serial.println("PID update refused: disarm and use non-negative gains.");
          else {
            yawRatePID.kp = kp; yawRatePID.ki = ki; yawRatePID.kd = kd;
            yawRatePID.reset(); Serial.println("Yaw-rate PID updated.");
          }
        } else {
          Serial.println("Unknown command. Enter HELP.");
        }
      }
    } else if (length < sizeof(buffer) - 1) {
      buffer[length++] = (char)toupper((unsigned char)c);
    } else {
      length = 0;
    }
  }
}
